#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ittechlearning/Testing-Production-Public_AWS/runs/run-FqcDyAvFAXN6FzQY

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
aws_vpc.TestProdPublic_VPC: Refreshing state... [id=vpc-0855eb75674f13a84]
aws_route_table.TestProdPublic_Management_Pri_RT: Refreshing state... [id=rtb-00bfbc8a327bc20c3]
aws_route_table.TestProdPublic_Private_Bckup_RT: Refreshing state... [id=rtb-03774a8420e66a195]
aws_route_table.TestProdPublic_Public_Pri_RT: Refreshing state... [id=rtb-0738bd592fc922721]
aws_subnet.TestProdPublic_Public_Bckup_us-east-2b: Refreshing state... [id=subnet-022c4c4b7c6dcfa8d]
aws_route_table.TestProdPublic_DMZ_Pri_RT: Refreshing state... [id=rtb-0448fef4ed9a572eb]
aws_subnet.TestProdPublic_DMZ_Pri_us-east-2a: Refreshing state... [id=subnet-0f18d0075dbdb95b9]
aws_subnet.TestProdPublic_Private_Bckup_us-east-2b: Refreshing state... [id=subnet-0eed250c72c30c5cd]
aws_subnet.TestProdPublic_Management_Pri_us-east-2a: Refreshing state... [id=subnet-019f0bdc206238443]
aws_route_table.TestProdPublic_Private_Pri_RT: Refreshing state... [id=rtb-0c7cc872288ddc2d4]
aws_subnet.TestProdPublic_DMZ_Bckup_us-east-2b: Refreshing state... [id=subnet-0a395e18b0cd29d4e]
aws_route_table.TestProdPublic_Public_Bckup_RT: Refreshing state... [id=rtb-0c908afcd4e69ade1]
aws_route_table.TestProdPublic_DMZ_Bckup_RT: Refreshing state... [id=rtb-0f884d6038e9a4d46]
aws_subnet.TestProdPublic_Management_Bckup_us-east-2b: Refreshing state... [id=subnet-0201f7448ed3850c9]
aws_route_table.TestProdPublic_Management_Bckup_RT: Refreshing state... [id=rtb-08c528084d74b7904]
aws_subnet.TestProdPublic_Public_Pri_us-east-2a: Refreshing state... [id=subnet-0fe083944e954d97c]
aws_internet_gateway.TestProd_IGW: Refreshing state... [id=igw-0fa32bcd8af17ee05]
aws_route_table_association.TestProdPublic_DMZ_Pri: Refreshing state... [id=rtbassoc-0a83e59ece642427e]
aws_route_table_association.TestProdPublic_Private_Bckup: Refreshing state... [id=rtbassoc-0d867a7cd811e2e29]
aws_route_table_association.TestProdPublic_Management_Pri: Refreshing state... [id=rtbassoc-0ae378ff7086c597c]
aws_route_table_association.TestProdPublic_Public_Bckup: Refreshing state... [id=rtbassoc-06e4d8e2bb595c3ce]
aws_route_table_association.TestProdPublic_DMZ_Bckup: Refreshing state... [id=rtbassoc-0e8e2ba47138d459f]
aws_route_table_association.TestProdPublic_Management_Bckup: Refreshing state... [id=rtbassoc-041708c2753381c6a]
aws_route.TestProdPublic_Public_Bckup_Default_Route_Outbound: Refreshing state... [id=r-rtb-0c908afcd4e69ade11080289494]
aws_route.TestProdPublic_Management_Pri_Default_Route_Outbound: Refreshing state... [id=r-rtb-00bfbc8a327bc20c31080289494]
aws_route.TestProdPublic_Public_Pri_Default_Route_Outbound: Refreshing state... [id=r-rtb-0738bd592fc9227211080289494]
aws_route.TestProdPublic_Management_Bckup_Default_Route_Outbound: Refreshing state... [id=r-rtb-08c528084d74b79041080289494]
aws_route_table_association.TestProdPublic_Public_Pri: Refreshing state... [id=rtbassoc-07b01c748e80a76dd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route_table_association.TestProdPublic_Private_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Private_Pri" {
      + id             = (known after apply)
      + route_table_id = "rtb-0c7cc872288ddc2d4"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.TestProdPublic_Private_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Private_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + vpc_id                                         = "vpc-0855eb75674f13a84"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @drobinson-cl, Action: `pull_request`*